Revit 2027 API
Parameter.GUID Property
The Guid for a shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GUID { get; }
Public ReadOnly Property GUID As Guid
	Get
public:
property Guid GUID {
	Guid get ();
}
member GUID : Guid with get
Property Value
Guid
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the parameter is not a shared parameter.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace